panvicka/CubeMonitor-VUE-Demo-MCU/CubeMon-Vue-Demo-STM32F407VGT6U/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BUTTON_Pin GPIO_PIN_0
#define BUTTON_GPIO_Port GPIOA
#define DO_1_Pin GPIO_PIN_0
#define DO_1_GPIO_Port GPIOB
#define DO_2_Pin GPIO_PIN_1
#define DO_2_GPIO_Port GPIOB
#define DI_1_Pin GPIO_PIN_7
#define DI_1_GPIO_Port GPIOE
#define DI_2_Pin GPIO_PIN_8
#define DI_2_GPIO_Port GPIOE
#define DIODE_PWM_GREEN_Pin GPIO_PIN_12
#define DIODE_PWM_GREEN_GPIO_Port GPIOD
#define DIODE_DO_ORANGE_Pin GPIO_PIN_13
#define DIODE_DO_ORANGE_GPIO_Port GPIOD
#define DIODE_DO_RED_Pin GPIO_PIN_14
#define DIODE_DO_RED_GPIO_Port GPIOD
#define DIODE_DO_BLUE_Pin GPIO_PIN_15
#define DIODE_DO_BLUE_GPIO_Port GPIOD
/* USER CODE BEGIN Private defines */
#define ALLOW_CUBEMX_OVERWRITE
#define ALLOW_CUBEMX_BACKDOOR

#define USE_WATCHDOG
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
